{
    "version": "https://jsonfeed.org/version/1",
    "title": "loaders.re",
    "description": "",
    "home_page_url": "https://bsendpacket.github.io/loaders.re",
    "feed_url": "https://bsendpacket.github.io/loaders.re/feed.json",
    "user_comment": "",
    "author": {
        "name": "bsendpacket, donaldduck8"
    },
    "items": [
        {
            "id": "https://bsendpacket.github.io/loaders.re/about/",
            "url": "https://bsendpacket.github.io/loaders.re/about/",
            "title": "loaders.re",
            "summary": "This project is coming soon. For now, here is what we have planned: Loader families commonly go unlabeled within malware analysis reporting, unless they are popular or infamous. Even if reporting for a loader exists, it can be very difficult to find due to the&hellip;",
            "content_html": "<blockquote>\n<p>This project is coming soon. For now, here is what we have planned:</p></blockquote>\n<p>Loader families commonly go unlabeled within malware analysis reporting, unless they are popular or infamous. Even if reporting for a loader exists, it can be very difficult to find due to the interchangable nature of loaders. </p><p>This makes loader tracking quite difficult, and thus—we have decided to create a taxonomy system to facilitate easier tracking and lookup of loaders.</p><h3 id=\"reinventing-the-wheel\">Reinventing the wheel?</h3>\n<p>Have you ever heard of HijackLoader? IDATLoader? Maybe you have, but did you know that it is also named GHOSTPULSE? What about ASMCrypt or DoubleFinger? SHADOWLADDER? Turns out, based on open-source reporting, these are all apparently different names for essentially the same thing.</p><p>Within industry reporting, it is very common for multiple names to be utilized for the same malware family, and we understand that we are the 15th competing standard to fix them all—however, we are hoping to aggregate loader characteristics in a way that simplifies the hunting of loaders.</p><p>With this in mind, we are creating a new taxonomical system to label loaders, inspired by the naming schemes that companies typically adopt for adversaries. </p><p>For example, within some companies, <code>Spider</code> is utilized for financially motivated groups and <code>Sleet</code> is utilized for groups out of North Korea.</p><h3 id=\"how-does-it-work\">How does it work?</h3>\n<p>There’s a fundamental problem with naming loaders. Most infection chains utilize several disjoint stages, and even “one loader” might consist of several components written in different languages by different developers. Sometimes, further stages are added or removed from loaders as well, making it difficult to definitively state which loader is used when.</p><p>That is a problem that is beyond the scope of this project. Our goal is simply to connect words with individual stages and hopefully connect the stages to their characteristics such as searchable strings, API calls, and a general understanding of its logic.</p><p>We are also hoping for some help from the community in order to add new entries and to help build a comprehensive list of loaders. We also hope that the community can help identify the loaders described within the compendium. </p><p>We understand that there are likely hundreds of thousands of loaders out there, and creating a lookup for every single loader is infeasible, but we hope to make even just a few analysts’ jobs easier. We also understand that this will take time, and we don’t (and won’t ever) promise that this will be ‘complete’ in any way, shape, or form. This is (in its current stage) simply a passion project in which we try to contribute information for loaders we analyze in our free time.</p><p>With that in mind, the general idea is as follows:</p><ul>\n<li>The programming language(s) utilized by an individual stage is represented by a mineral/gemstone.</li>\n<li>A random flower name is utilized to identify the logic of a given loader stage.</li>\n</ul>\n<p>Here is an example loader chain:</p><ol>\n<li><em>QuartzDahlia</em> (Launch4j)</li>\n<li><em>AmberAmethystDaisy</em> (JPHP portion of D3F@ck Loader)</li>\n<li><em>QuartzBegonia</em> (Unknown C++ Loader)</li>\n<li><em>DiamondDaffodil</em> (Shellcode stage within QuartzBegonia)</li>\n<li><em>LummaStealer</em></li>\n</ol>\n<p>Here is the current list of programming languages corresponding to mineral/gemstones. This is not comprehensive, and in fact, we don’t know if loaders even exist for all of these languages. As more languages end up being used within loaders, the list will get an update.</p><table>\n<thead>\n<tr>\n<th>Language</th>\n<th>Mineral / Gemstone</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>AppleScript</td>\n<td>Moonstone</td>\n</tr>\n<tr>\n<td>Assembly/Shellcode</td>\n<td>Diamond</td>\n</tr>\n<tr>\n<td>AutoHotkey</td>\n<td>Tanzanite</td>\n</tr>\n<tr>\n<td>AutoIt</td>\n<td>Sapphire</td>\n</tr>\n<tr>\n<td>Batch Script</td>\n<td>Graphite</td>\n</tr>\n<tr>\n<td>C / C++</td>\n<td>Quartz</td>\n</tr>\n<tr>\n<td>C#</td>\n<td>Garnet</td>\n</tr>\n<tr>\n<td>D</td>\n<td>Axinite</td>\n</tr>\n<tr>\n<td>Dart</td>\n<td>Fluorite</td>\n</tr>\n<tr>\n<td>Delphi</td>\n<td>Turquoise</td>\n</tr>\n<tr>\n<td>GoLang</td>\n<td>Aquamarine</td>\n</tr>\n<tr>\n<td>Haskell</td>\n<td>Opal</td>\n</tr>\n<tr>\n<td>Java</td>\n<td>Amber</td>\n</tr>\n<tr>\n<td>JavaScript</td>\n<td>Sulfur</td>\n</tr>\n<tr>\n<td>Kotlin</td>\n<td>Emerald</td>\n</tr>\n<tr>\n<td>Lua</td>\n<td>Jade</td>\n</tr>\n<tr>\n<td>Nim</td>\n<td>Citrine</td>\n</tr>\n<tr>\n<td>NSIS</td>\n<td>Tourmaline</td>\n</tr>\n<tr>\n<td>Objective-C</td>\n<td>Beryl</td>\n</tr>\n<tr>\n<td>OCaml</td>\n<td>Hematite</td>\n</tr>\n<tr>\n<td>PascalScript</td>\n<td>Jasper</td>\n</tr>\n<tr>\n<td>Perl</td>\n<td>Pearl</td>\n</tr>\n<tr>\n<td>PHP</td>\n<td>Amethyst</td>\n</tr>\n<tr>\n<td>PowerShell</td>\n<td>Onyx</td>\n</tr>\n<tr>\n<td>Python</td>\n<td>Topaz</td>\n</tr>\n<tr>\n<td>R</td>\n<td>Fluorite</td>\n</tr>\n<tr>\n<td>Ruby</td>\n<td>Ruby</td>\n</tr>\n<tr>\n<td>Rust</td>\n<td>Cinnabar</td>\n</tr>\n<tr>\n<td>Scala</td>\n<td>Malachite</td>\n</tr>\n<tr>\n<td>Shell</td>\n<td>Obsidian</td>\n</tr>\n<tr>\n<td>Swift</td>\n<td>Peridot</td>\n</tr>\n<tr>\n<td>TypeScript</td>\n<td>Azurite</td>\n</tr>\n<tr>\n<td>Visual Basic</td>\n<td>Lapis</td>\n</tr>\n<tr>\n<td>VBScript</td>\n<td>Jet</td>\n</tr>\n<tr>\n<td>Zig</td>\n<td>Zircon</td>\n</tr>\n</tbody></table>\n",
            "image": "https://bsendpacket.github.io/loaders.re/media/posts/1/hacking_a_bunch_of_flowers_and_crystals.png",
            "author": {
                "name": "bsendpacket, donaldduck8"
            },
            "tags": [
            ],
            "date_published": "2024-06-21T17:28:41-04:00",
            "date_modified": "2024-06-22T09:26:30-04:00"
        }
    ]
}
